# 题目：1004 成绩排名
#
# 题目描述：
#   读入 n（>0）名学生的姓名、学号、成绩，分别输出成绩最高和成绩最低学生的姓名和学号。
#
# 输入格式：
#   每个测试输入包含 1 个测试用例，格式为
#   ```
#   第 1 行：正整数 n
#   第 2 行：第 1 个学生的姓名 学号 成绩
#   第 3 行：第 2 个学生的姓名 学号 成绩
#   ... ... ...
#   第 n+1 行：第 n 个学生的姓名 学号 成绩
#   ```
#   其中`姓名`和`学号`均为不超过 10 个字符的字符串，成绩为 0 到 100 之间的一个整数，这里保证在一组测试用例中没有两个学生的成绩是相同的。
#
# 输出格式：
#   对每个测试用例输出 2 行，第 1 行是成绩最高学生的姓名和学号，第 2 行是成绩最低学生的姓名和学号，字符串间有 1 空格。
#
# 实现原理：
#   - 排序算法
#   - 循环迭代处理
#   - 列表操作
#
# 算法思路：
#   排序与查找：读取学生成绩信息，
#   按分数排序后找出最高分和最低分。
#
import sys

students = [sys.stdin.readline().split() for _ in range(int(sys.stdin.readline()))]
students.sort(key=lambda x: int(x[2]))
print(*students[0][:2])
print(*students[-1][:2])
